In [2]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

### 1、pandas的数据结构

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
'b' in obj2

True

In [7]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [8]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [9]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [10]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [11]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [12]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [15]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [17]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [18]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [21]:
frame.loc[3]

state    Nevada
year       2001
pop         2.4
Name: 3, dtype: object

In [24]:
frame['debt'] = np.arange(6)
frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [25]:
frame['eastern'] = frame.state == 'Ohio'

In [26]:
del frame['eastern']
frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [28]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [29]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

### 2、基本功能

In [3]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [7]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
   ....:                      index=['a', 'c', 'd'],
   ....:                      columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [9]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [10]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [11]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [13]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
   .....:                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [18]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [19]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [21]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [22]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
   .....:                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [24]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [25]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [27]:
data[data < 5] = 0

In [28]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [30]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [32]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [33]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [34]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [35]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [36]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [37]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [38]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [39]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [40]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [41]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
   .....:                      columns=list('bde'),
   .....:                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [42]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [43]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [44]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [45]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [46]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [47]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [48]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
   .....:                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.912160 -0.118267  0.884868
Ohio   -1.259700 -0.046600  1.275486
Texas  -1.723766 -1.524184 -0.223648
Oregon  1.673967 -0.440297  2.181938

In [49]:
np.abs(frame)

               b         d         e
Utah    0.912160  0.118267  0.884868
Ohio    1.259700  0.046600  1.275486
Texas   1.723766  1.524184  0.223648
Oregon  1.673967  0.440297  2.181938

In [50]:
f = lambda x:x.max() - x.min()
frame.apply(f)

b    3.397733
d    1.477585
e    2.405587
dtype: float64

In [51]:
frame.apply(f,axis=1)

Utah      1.797028
Ohio      2.535186
Texas     1.500118
Oregon    2.622235
dtype: float64

In [52]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.91  -0.12   0.88
Ohio    -1.26  -0.05   1.28
Texas   -1.72  -1.52  -0.22
Oregon   1.67  -0.44   2.18

In [53]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [54]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
   .....:                      index=['three', 'one'],
   .....:                      columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [55]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [56]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [57]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [58]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [59]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [60]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [61]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [63]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [64]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [65]:
obj.index.is_unique

False

In [66]:
obj['a']

a    0
a    1
dtype: int64

In [67]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.621195  0.356329 -0.454861
a  0.930408  0.251960 -0.498870
b -0.948310 -0.568075  1.486359
b  0.253784 -1.573249 -1.419697

In [68]:
df.loc['a']

          0         1         2
a  0.621195  0.356329 -0.454861
a  0.930408  0.251960 -0.498870

In [69]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   .....:                    [np.nan, np.nan], [0.75, -1.3]],
   .....:                   index=['a', 'b', 'c', 'd'],
   .....:                   columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [70]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [71]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [72]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [73]:
df.idxmax()

one    b
two    d
dtype: object

In [74]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [75]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [76]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [77]:
import pandas_datareader.data as web

In [78]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})
returns = price.pct_change()
returns.tail()

RemoteDataError: Unable to read URL: https://finance.yahoo.com/quote/AAPL/history?period1=1488312000&period2=1646078399&interval=1d&frequency=1d&filter=history
Response Text:
b'<!DOCTYPE html>\n<html lang="zh">\n<head>\n    <meta charset="utf-8">\n    <title>Yahoo</title>\n    <meta name="viewport" content="width=device-width,initial-scale=1,minimal-ui">\n    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">\n    <style>\nhtml {\n  height: 100%;\n}\nbody {\n  background: #fafafc url(https://s.yimg.com/nn/img/sad-panda-201402200631.png) 50% 50%;\n  background-size: cover;\n  height: 100%;\n  text-align: center;\n  font: 300 16px "helvetica neue", helvetica, verdana, tahoma, arial, sans-serif;\n}\n#message {\n  text-align: left;\n  font-weight: 400;\n  color: #1A1A1A;\n}\n#message a {\n  padding: 0 3px;\n}\n#container {\n  position: absolute;\n  top: 50%;\n  left: 50%;\n  padding: 0 30px;\n  margin-right: -50%;\n  transform: translate(-50%, -50%);\n  max-width: 40em;\n  _width: 40em;\n}\n#container img {\n  width: 174px;\n  height: auto;\n}\n#switcher a {\n  font-weight: 400;\n}\n#switcher a.active {\n  color: #000;\n  text-decoration: none;\n  cursor: default;\n}\n    </style>\n</head>\n<body>\n  <div id="container">\n    <img src="https://s.yimg.com/rz/p/yahoo_homepage_en-US_s_f_p_bestfit_homepage_2x.png" alt="Yahoo Logo">\n    <div id="switcher">\n      <a data-lang="en" class="active" href=\'#\'>English</a> |\n      <a data-lang="zh-Hant" href=\'#\'>\xe7\xb9\x81\xe9\xab\x94\xe4\xb8\xad\xe6\x96\x87</a> |\n      <a data-lang="zh-Hans" href=\'#\'>\xe7\xae\x80\xe4\xbd\x93\xe4\xb8\xad\xe6\x96\x87</a>\n    </div>\n    <div id="message">\n      <p>As of November 1st, 2021 Yahoo\xe2\x80\x99s suite of services will no longer be accessible from mainland China. Yahoo products and services remain unaffected in all other global locations. We thank you for your support and readership.</p>\n      <p>To access your Yahoo Mail account, please click <a href="https://mail.yahoo.com/">here</a> (or copy and paste this URL into your browser: https://mail.yahoo.com/). To access your AOL Mail account, please click <a href="https://mail.aol.com/">here</a> (or copy and paste this URL into your browser: https://mail.aol.com/). To access your Privacy Dashboard to download any data, please click <a href="https://legal.yahoo.com/us/en/yahoo/privacy/dashboard/index.html">here</a>.</p>\n    </div>\n  </div>\n<script>\nconst Msg = {\n  \'en\': \'<p>As of November 1st, 2021 Yahoo\xe2\x80\x99s suite of services will no longer be accessible from mainland China. Yahoo products and services remain unaffected in all other global locations. We thank you for your support and readership.</p><p>To access your Yahoo Mail account, please click <a href="https://mail.yahoo.com/">here</a> (or copy and paste this URL into your browser: https://mail.yahoo.com/). To access your AOL Mail account, please click <a href="https://mail.aol.com/">here</a> (or copy and paste this URL into your browser: https://mail.aol.com/). To access your Privacy Dashboard to download any data, please click <a href="https://legal.yahoo.com/us/en/yahoo/privacy/dashboard/index.html">here</a>.</p>\',\n  \'zh-Hant\': \'<p>2021 \xe5\xb9\xb4 11 \xe6\x9c\x88 1 \xe6\x97\xa5\xe8\xb5\xb7\xef\xbc\x8c\xe7\x94\xa8\xe6\x88\xb6\xe5\xb0\x87\xe7\x84\xa1\xe6\xb3\x95\xe5\xbe\x9e\xe4\xb8\xad\xe5\x9c\x8b\xe5\xa4\xa7\xe9\x99\xb8\xe4\xbd\xbf\xe7\x94\xa8 Yahoo \xe7\x9a\x84\xe7\x94\xa2\xe5\x93\x81\xe8\x88\x87\xe6\x9c\x8d\xe5\x8b\x99\xe3\x80\x82\xe9\x80\x99\xe4\xb8\xa6\xe4\xb8\x8d\xe5\xbd\xb1\xe9\x9f\xbf Yahoo \xe5\x9c\xa8\xe5\x85\xa8\xe7\x90\x83\xe5\x85\xb6\xe4\xbb\x96\xe5\x9c\xb0\xe6\x96\xb9\xe7\x9a\x84\xe7\x94\xa2\xe5\x93\x81\xe5\x8f\x8a\xe6\x9c\x8d\xe5\x8b\x99\xe3\x80\x82\xe6\x88\x91\xe5\x80\x91\xe6\x84\x9f\xe8\xac\x9d\xe6\x82\xa8\xe4\xb8\x80\xe7\x9b\xb4\xe4\xbb\xa5\xe4\xbe\x86\xe7\x9a\x84\xe6\x94\xaf\xe6\x8c\x81\xe3\x80\x82</p><ul><li>\xe8\xab\x8b<a href="https://mail.yahoo.com/">\xe6\x8c\x89\xe6\xad\xa4</a>\xe9\x80\xa3\xe6\x8e\xa5 Yahoo \xe9\x9b\xbb\xe5\xad\x90\xe4\xbf\xa1\xe7\xae\xb1(\xe6\x88\x96\xe5\x89\xaa\xe8\xb2\xbc\xe7\xb6\xb2\xe5\x9d\x80 https://mail.yahoo.com/ \xe5\x88\xb0\xe7\x80\x8f\xe8\xa6\xbd\xe5\x99\xa8\xef\xbc\x89</li><li>\xe8\xab\x8b<a href="https://mail.aol.com/">\xe6\x8c\x89\xe6\xad\xa4</a>\xe9\x80\xa3\xe6\x8e\xa5 AOL \xe9\x9b\xbb\xe5\xad\x90\xe4\xbf\xa1\xe7\xae\xb1(\xe6\x88\x96\xe5\x89\xaa\xe8\xb2\xbc\xe7\xb6\xb2\xe5\x9d\x80 https://mail.aol.com/ \xe5\x88\xb0\xe7\x80\x8f\xe8\xa6\xbd\xe5\x99\xa8 \xef\xbc\x89</li><li>\xe8\xab\x8b<a href="https://legal.yahoo.com/us/en/yahoo/privacy/dashboard/index.html">\xe6\x8c\x89\xe6\xad\xa4</a>\xe9\x80\xa3\xe6\x8e\xa5\xe6\x82\xa8\xe7\x9a\x84\xe9\x9a\xb1\xe7\xa7\x81\xe5\x84\x80\xe8\xa1\xa8\xe7\x89\x88\xe6\x88\x96\xe4\xb8\x8b\xe8\xbc\x89\xe8\xb3\x87\xe6\x96\x99\xe3\x80\x82</li></ul>\',\n  \'zh-Hans\': \'<p>2021 \xe5\xb9\xb4 11 \xe6\x9c\x88 1 \xe6\x97\xa5\xe8\xb5\xb7\xef\xbc\x8c\xe7\x94\xa8\xe6\x88\xb7\xe5\xb0\x86\xe6\x97\xa0\xe6\xb3\x95\xe4\xbb\x8e\xe4\xb8\xad\xe5\x9b\xbd\xe5\xa4\xa7\xe9\x99\x86\xe4\xbd\xbf\xe7\x94\xa8 Yahoo \xe7\x9a\x84\xe4\xba\xa7\xe5\x93\x81\xe4\xb8\x8e\xe6\x9c\x8d\xe5\x8a\xa1\xe3\x80\x82\xe8\xbf\x99\xe5\xb9\xb6\xe4\xb8\x8d\xe5\xbd\xb1\xe5\x93\x8d Yahoo \xe5\x9c\xa8\xe5\x85\xa8\xe7\x90\x83\xe5\x85\xb6\xe4\xbb\x96\xe5\x9c\xb0\xe6\x96\xb9\xe7\x9a\x84\xe4\xba\xa7\xe5\x93\x81\xe5\x8f\x8a\xe6\x9c\x8d\xe5\x8a\xa1\xe3\x80\x82\xe6\x88\x91\xe4\xbb\xac\xe6\x84\x9f\xe8\xb0\xa2\xe4\xbd\xa0\xe4\xb8\x80\xe7\x9b\xb4\xe4\xbb\xa5\xe4\xbe\x86\xe7\x9a\x84\xe6\x94\xaf\xe6\x8c\x81\xe3\x80\x82</p><ul><li>\xe8\xaf\xb7<a href="https://mail.yahoo.com/">\xe6\x8c\x89\xe6\xad\xa4</a>\xe8\xbf\x9e\xe6\x8e\xa5 Yahoo \xe7\x94\xb5\xe5\xad\x90\xe4\xbf\xa1\xe7\xae\xb1(\xe6\x88\x96\xe5\x89\xaa\xe8\xb4\xb4\xe7\xbd\x91\xe5\x9d\x80 https://mail.yahoo.com/ \xe5\x88\xb0\xe6\xb5\x8f\xe8\xa7\x88\xe5\x99\xa8\xef\xbc\x89</li><li>\xe8\xaf\xb7<a href="https://mail.aol.com/">\xe6\x8c\x89\xe6\xad\xa4</a>\xe8\xbf\x9e\xe6\x8e\xa5 AOL \xe7\x94\xb5\xe5\xad\x90\xe4\xbf\xa1\xe7\xae\xb1(\xe6\x88\x96\xe5\x89\xaa\xe8\xb4\xb4\xe7\xbd\x91\xe5\x9d\x80 https://mail.aol.com/ \xe5\x88\xb0\xe6\xb5\x8f\xe8\xa7\x88\xe5\x99\xa8 \xef\xbc\x89</li><li>\xe8\xaf\xb7<a href="https://legal.yahoo.com/us/en/yahoo/privacy/dashboard/index.html">\xe6\x8c\x89\xe6\xad\xa4</a>\xe6\xb5\x8f\xe8\xa7\x88\xe4\xbd\xa0\xe7\x9a\x84\xe9\x9a\x90\xe7\xa7\x81\xe4\xbb\xaa\xe8\xa1\xa8\xe7\x89\x88\xe6\x88\x96\xe4\xb8\x8b\xe8\xbd\xbd\xe8\xb5\x84\xe6\x96\x99\xe3\x80\x82</li></ul>\'\n};\n\nconst message = document.querySelector(\'#message\');\n\nconst switchLang = function (lang) {\n  message.innerHTML = Msg[lang] ? Msg[lang] : Msg.en;\n  const oldE = document.querySelector(\'#switcher .active\');\n\tconst newE = document.querySelector(`#switcher a[data-lang=${lang}]`);\n  oldE.className = \'\';\n  newE.className = \'active\';\n}\n\nconst detectLang = function() {\n  const langs = window.navigator.languages ? window.navigator.languages : [window.navigator.language];\n  const availableLangs = langs.map(l => l.toLowerCase()).filter(l => /^en/.test(l) || /^zh/.test(l));\n  const selectedLang = availableLangs.length ? availableLangs[0] : \'en\';\n  const prefLang =  /^en/.test(selectedLang) ? \'en\' :\n      (selectedLang === \'zh-tw\' || selectedLang === \'zh-hk\') ? \'zh-Hant\' : \'zh-Hans\';\n  switchLang(prefLang);\n}\n\nconst switcher = document.querySelector(\'#switcher\');\nswitcher.addEventListener(\'click\', (e) => {\n  const lang = e.target.getAttribute(\'data-lang\');\n  switchLang(lang);\n});\n\ndetectLang();\n\n</script>\n</body></html>\n'

In [80]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [81]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [82]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [84]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [85]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [86]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
   .....:                      'Qu2': [2, 3, 1, 2, 3],
   .....:                      'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [87]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0